import { useState } from "react"
import { v4 as uuid } from "uuid"

const emojis = [
    "😀", "😁", "😂", "🤣", "😃", "😄", "😅", "😆", "😉", "😊", 
    "😋", "😎", "😍", "😘", "😗", "😙", "😚", "🙂", "🤗", "🤔", 
    "😐", "😑", "😶", "🙄", "😏", "😣", "😥", "😮", "🤐", "😯", 
    "😪", "😫", "😴", "😌", "😛", "😜", "😝", "🤤", "😒", "😓", 
    "😔", "😕", "🙃", "🤑", "😲", "☹️", "🙁", "😖", "😞", "😟", 
    "😤", "😢", "😭", "😦", "😧", "😨", "😩", "😰", "😱", "😳", 
    "😵", "😡", "😠", "😷", "🤒", "🤕", "🤢", "🤧", "😇", "🤠", 
    "🤡", "🤥", "🤓", "😈", "👿", "👹", "👺", "💀", "👻", "👽", 
    "👾", "🤖", "💩", "😺", "😸", "😹", "😻", "😼", "😽", "🙀", 
    "😿", "😾", "👐", "🙌", "👏", "🙏", "👍", "👎", "👊", "✊", 
    "🤛", "🤜", "🤞", "✌️", "🤘", "👌", "👈", "👉", "👆", "👇", 
    "✋", "🤚", "🖐️", "🖖", "👋", "🤙", "💪", "🖕", "✍️", "🤳", 
    "💅", "💍", "💄", "💋", "👄", "👅", "👂", "👃", "👣", "👁️", 
    "👀", "🧠", "🗣️", "👤", "👥", "👶", "👧", "👦", "👩", "👨", 
    "👵", "👴", "👲", "👳‍♀️", "👳‍♂️", "🧕", "👮‍♀️", "👮‍♂️", "👷‍♀️", "👷‍♂️", 
    "💂‍♀️", "💂‍♂️", "🕵️‍♀️", "🕵️‍♂️", "👩‍⚕️", "👨‍⚕️", "👩‍🌾", "👨‍🌾", "👩‍🍳", "👨‍🍳", 
    "👩‍🎓", "👨‍🎓", "👩‍🏫", "👨‍🏫", "👩‍🏭", "👨‍🏭", "👩‍💻", "👨‍💻", "👩‍💼", "👨‍💼", 
    "👩‍🔧", "👨‍🔧", "👩‍🔬", "👨‍🔬", "👩‍🎨", "👨‍🎨", "👩‍🚒", "👨‍🚒", "👩‍✈️", "👨‍✈️", 
    "👩‍🚀", "👨‍🚀", "👩‍⚖️", "👨‍⚖️", "👰", "🤵", "👸", "🤴", "🤶", "🎅", 
    "🧙‍♀️", "🧙‍♂️", "🧝‍♀️", "🧝‍♂️", "🧛‍♀️", "🧛‍♂️", "🧟‍♀️", "🧟‍♂️", "🧞‍♀️", "🧞‍♂️", 
    "🧜‍♀️", "🧜‍♂️", "🧚‍♀️", "🧚‍♂️", "👼", "🤰", "🤱", "🙇‍♀️", "🙇‍♂️", "💁‍♀️", 
    "💁‍♂️", "🙅‍♀️", "🙅‍♂️", "🙆‍♀️", "🙆‍♂️", "🙋‍♀️", "🙋‍♂️", "🤦‍♀️", "🤦‍♂️", "🤷‍♀️", 
    "🤷‍♂️", "🙎‍♀️", "🙎‍♂️", "🙍‍♀️", "🙍‍♂️", "💇‍♀️", "💇‍♂️", "💆‍♀️", "💆‍♂️", "🧖‍♀️", 
    "🧖‍♂️", "💅", "🤳", "💃", "🕺", "👯‍♀️", "👯‍♂️", "🕴️", "🚶‍♀️", "🚶‍♂️", 
    "🏃‍♀️", "🏃‍♂️", "👫",]

export default function EmojiClicker(){
    const [emoji, setEmoji] = useState([{id: uuid(), emoji: randomEmoji()}])
    function randomEmoji(){
        return emojis[Math.floor(Math.random() * emojis.length)]
    }
    function addEmoji(){
        setEmoji(prevEmoji => [...prevEmoji, {id: uuid(), emoji: randomEmoji()}])
    }
    function deleteEmoji(e){
        console.log(e)
        setEmoji(prevEmoji => prevEmoji.filter(emoji => emoji.id !== e.id))
    }
    function changeToHearts(){
        setEmoji(prevEmoji => prevEmoji.map(e => {
            return {id: e.id, emoji: "❤️"}
        }))
    }
    return(
        <div>
            {emoji.map(e => (
                <span onClick={() => deleteEmoji(e)} style={{fontSize: "4rem"}} key={e.id}>{e.emoji}</span>
                ))}
            <button onClick={addEmoji}>Add Emoji</button>
            <button onClick={changeToHearts}>Make All Hearts</button>
        </div>
    )
}